#include <iostream>
#include <cstdio>
#include <clocale>

using namespace std;

int main()
{
    setlocale (LC_ALL, "ukr");
    int a, b, c;
    char n='Y';
    while (n=='Y' || n=='y')
    {
    cout<<"Введiть дату: ";
    cin>>a>>b>>c;
    if (a<=0 || b<=0 || b>12 || ((b==1 || b==3 || b==5 || b==7 || b==8 ||  b==10 ||b==12) && a>31) || (b==2 && a>29 && c%4==0) || (b==2 && a>28 && c%4!=0) || ((b==4 || b==6 || b==9 || b==11) && a>30))
        cout<<("Ви ввели некоректну дату");
            else if(((b==1 || b==3 || b==5 || b==7 || b==8 ||  b==10 ||b==12) && a<31) || ((b==4 || b==6 || b==9 || b==11) && a<30) || (b==2 && a<29 && c%4==0) || (b==2 && a<28 && c%4!=0))
                {
                    a++;
                    if (c>=0)
                        cout<<"Наступна дата: "<<a<<" "<<b<<" "<<c;
                    else cout<<"Наступна дата: "<<a<<" "<<b<<" "<<-c<<" до нашої ери";
                }
                else
                        if (b==12)
                        {
                            a=1; b=1; c++;
                            if (c>=0)
                                cout<<"Наступна дата: "<<a<<" "<<b<<" "<<c;
                            else cout<<"Наступна дата: "<<a<<" "<<b<<" "<<-c<<" до нашої ери";
                        }
                        else
                        {
                            a=1; b++;
                             if (c>=0)
                                cout<<"Наступна дата: "<<a<<" "<<b<<" "<<c;
                            else cout<<"Наступна дата: "<<a<<" "<<b<<" "<<-c<<" до нашої ери";
                        }
        cout<<"\nЩоб спробувати ще натиснiть \"Y\" - ";
        cin>>n;
    }
    return 0;
}
