#include <iostream>
#include <iomanip>
#include <cstring>
#include <windows.h>

using namespace std;

struct marks{
    int programming, sda, linear_algebra,math;};
struct kimnata {
    int poverh;
    int noverkimnaty;
};
struct student{
    string surname, name, nameoffather;
    kimnata a;
    marks b;};

    const int n=28;
    student F[28];

void input()
{
    F[0]={" Аллахвердiєв", " Кирило " "Дмитрович    "};  F[0].a={2, 32};    F[0].b={4, 3, 5, 4};
    F[1]={" Бiдяк " "Михайло " "Андрiйович         "};   F[1].a={12, 10};   F[1].b={5, 3, 4, 4};
    F[2]={" Бойко ", "Михайло ", "Євгенiйович        "}; F[2].a={11, 13};   F[2].b={4, 4, 5, 3};
    F[3]={" Бровдiй ", "Євгенiй ", "Юрiйович         "}; F[3].a={2, 45};     F[3].b={4, 5, 5, 4};
    F[4]={" Карманов " ,"Роман ", "В`ячеславович     "}; F[4].a={};         F[4].b={4, 3, 5, 4};
    F[5]={" Касянчук ", "Дмитро ", "Павлович         "}; F[5].a={4, 31};    F[5].b={4, 5, 5, 5};
    F[6]={" Керiмов ", "Хiкмет ", "НематОгли         "}; F[6].a={};         F[6].b={4, 4, 5, 4};
    F[7]={" Коровiй ", "Олександр " ,"Сергiйович     "}; F[7].a={12, 10};   F[7].b={4, 3, 5, 4};
    F[8]={" Курдус ", "Анастасiя " ,"Олександрiвна   "}; F[8].a={2, 34};    F[8].b={5, 5, 5, 4};
    F[9]={" Олефiренко " ,"Олександр ", "Вiталiйович"};  F[9].a={};         F[9].b={4, 4, 4, 4};
    F[10]={" Олiйник ", "Олександр ", "Валерiйович   "}; F[10].a={4, 35};   F[10].b={4, 3, 5, 4};
    F[11]={" Пастернак ", "Сергiй " ,"Олександрович  "}; F[11].a={};        F[11].b={3, 3, 5, 4};
    F[12]={" Пiвень ", "Ярослав ", "Владиславович    "}; F[12].a={1, 31};   F[12].b={4, 3, 5, 4};
    F[13]={" Рекеда ", "Володимир ", "Валерiйович    "}; F[13].a={};        F[13].b={4, 5, 5, 5};
    F[14]={" Савельєва " ,"Анна ", "Аркадiївна       "}; F[14].a={};        F[14].b={5, 4, 5, 4};
    F[15]={" Савосько ", "Олександра " ,"Миколаївна  "}; F[15].a={2, 21};   F[15].b={4, 5, 5, 4};
    F[16]={" Сметана ", "Максим " ,"Олександрович    "}; F[16].a={4, 35};   F[16].b={4, 4, 5, 5};
    F[17]={" Смiюн " ,"Iнна " ,"Володимирiвна        "}; F[17].a={3, 23};   F[17].b={4, 4, 5, 4};
    F[18]={" Снопок " ,"Артем " ,"Iгорович           "}; F[18].a={};        F[18].b={4, 5, 5, 4};
    F[19]={" Тельман " ,"Валентин ", "Вiкторович     "}; F[19].a={4, 35};   F[19].b={4, 3, 5, 4};
    F[20]={" Хлоп`ячий ", "Олександр " ,"Андрiйович  "}; F[20].a={};        F[20].b={5, 5, 4, 5};
    F[21]={" Хлоп`ячий ", "Павло ", "Андрiйович      "}; F[21].a={};        F[21].b={4, 5, 5, 4};
    F[22]={" Ціпун ", "Владислав " ,"Юрiйович        "}; F[22].a={};        F[22].b={5, 4, 5, 4};
    F[23]={" Чумак ", "Єгор ", "Сергiйович           "}; F[23].a={4, 10};   F[23].b={4, 4, 5, 4};
    F[24]={" Шостак ", "Михайло ", "Сергiйович       "}; F[24].a={12, 10};  F[24].b={4, 3, 5, 4};
    F[25]={" Штогрин ", "Павло ", "Петрович          "}; F[25].a={5, 36};   F[25].b={4, 4, 3, 5};
    F[26]={" Шуть ", "Максим " ,"Вікторович          "}; F[26].a={4, 35};   F[26].b={5, 3, 4, 4};
    F[27]={" Федорченко",  " Денис ", "Олегович       "};F[27].a={4, 21};   F[27].b={5, 5, 5, 5};
}

void output()

{   cout<<"_______________________________________________________________________________________"<<endl;
    cout<<setw(19)<<"Студент"<<setw(19)<<"|"<<"Програмування"<<"|"<<"СДА"<<"|"<<"Мат.аналіз"<<"|"<<"Лін.алгебра"<<"|"<<"Кімната"<<"|"<<endl;
    cout<<"---------------------------------------------------------------------------------------"<<endl;

    for(int i=0; i<=27; i++)
    {
        if(F[i].a.poverh==0)
        {
        cout<<"|"<<i+1<<"."<<F[i].surname<<F[i].name<<F[i].nameoffather<<"|";
        cout<<setw(7)<<F[i].b.programming<<setw(8)<<"| "<<F[i].b.sda<<" |";
        cout<<setw(6)<<F[i].b.math<<setw(5)<<"|"<<setw(6)<<F[i].b.linear_algebra<<setw(6)<<"|"<<setw(8)<<"|"<<endl;
        }
    else{
        cout<<"|"<<i+1<<"."<<F[i].surname<<F[i].name<<F[i].nameoffather<<"|";
        cout<<setw(7)<<F[i].b.programming<<setw(8)<<"| "<<F[i].b.sda<<" |";
        cout<<setw(6)<<F[i].b.math<<setw(5)<<"|"<<setw(6)<<F[i].b.linear_algebra<<setw(6)<<"|";
        cout<<setw(3)<<F[i].a.poverh<<"-"<<F[i].a.noverkimnaty<<setw(2)<<"|"<<endl;
    }
        cout<<"---------------------------------------------------------------------------------------"<<endl;
    }
}
void replacing()
{  cout<<"Студенти, що проживають на парних поверхах у гуртожитку:"<<endl;
    for(int i=0; i<=27; i++)
    {
        if((F[i].a.poverh%2==0)&&(F[i].a.poverh!=0))
        {
            cout<<F[i].surname<<F[i].name<<F[i].nameoffather <<" - "<<F[i].a.poverh<<"-"<<F[i].a.noverkimnaty<<endl;
        }
    }
}
int main()
{   setlocale(LC_ALL,"");
    system("chcp 1251");
    input();
    system("cls");
    output();
    system("pause");
    system("cls");
    replacing();
    return 0;
}
